OpenFOAM/freeSurfaceFlows/freeSurfaceFlows-0Fv2012/cases/spillway-v2012/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    inletWater
    {
        type            fixedValue;
        value           uniform (0.6 0 0);
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.6 0 0);
    }
    
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    dam
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
