OpenFOAM/freeSurfaceFlows/freeSurfaceFlows-0Fv2012/cases/spillway-v2012/0.org/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }

    inletWater
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    
    bottomWall
    {
        type            zeroGradient;
    }
    
    dam
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
